/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   9095_1, 2, 3 더하기.cpp                               :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: minskim2 <minskim2@student.42seoul.kr>     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/06/19 18:03:57 by minskim2          #+#    #+#             */
/*   Updated: 2022/06/19 20:18:05 by minskim2         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <iostream>
using namespace std;

int main() {
	ios::sync_with_stdio(0);
	cin.tie(0);
	int t, n;
	int v[12];
	cin >> t;
	v[1] = 1;
	v[2] = 2;
	v[3] = 4;
	for (int i=4; i<12; i++)
		v[i] = v[i-1] + v[i-2] + v[i-3];
	for (int i=0; i<t; i++) {
		cin >> n;
		cout << v[n] << "\n";
	}
}
