/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   예상 대진표.cpp                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: minskim2 <minskim2@student.42seoul.kr>     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/08/07 10:11:02 by minskim2          #+#    #+#             */
/*   Updated: 2022/08/07 10:26:46 by minskim2         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

using namespace std;

int solution(int n, int a, int b) {
	int answer = 0;
	while (n) {
		if (a == b)
			break;
		a = (a+1) / 2;
		b = (b+1) / 2;
		++answer;
		n /= 2;
	}
	return answer;
}
