/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   점프와 순간 이동.cpp                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: minskim2 <minskim2@student.42seoul.kr>     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/07/22 11:47:32 by minskim2          #+#    #+#             */
/*   Updated: 2022/07/22 12:43:13 by minskim2         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <iostream>

using namespace std;

int solution(int n) {
	int ans = 0;
	while (n != 0) {
		if (n % 2 == 0)
			n /= 2;
		else {
			n -= 1;
			++ans;
		}
	}
	return ans;
}
